Makker5000/TFE---Party-Screen/ESP-Enfant1/FINAL-ESP8266-Enfant1.c
#include <ESP8266WiFi.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <Adafruit_NeoMatrix.h>
#include <Adafruit_NeoPixel.h>
#include <stdio.h>
#include <EEPROM.h>

// ─────── CONFIGURATION EEPROM ────────────────────────────────────────────────
#define ADDR_CONFIGURED    0
#define ADDR_SCREEN_WIDTH  1
#define ADDR_SCREEN_HEIGHT 2
#define EEPROM_SIZE        16

// ─── CONFIGURATION GÉNÉRALE ────────────────────────────────────────────────
#define CHILD_NUM       1    // ← À changer pour chaque ESP (1,2,3...)
const char* WIFI_SSID   = "MonReseauESP";
const char* WIFI_PASS   = "ouiouioui";
const char* MQTT_BROKER = "192.168.1.10";
const uint16_t MQTT_PORT= 1883;
// const uint16_t MQTT_PORT= 8883; // <-- Port pour MQTTS
#define MQTT_MAX_PACKET_SIZE 8192

// Certificat CA du broker (copie du ca.crt en format PEM)
// const char* ca_cert = \
// "-----BEGIN CERTIFICATE-----\n" \
// "MIID... (ton contenu ici)\n" \
// "-----END CERTIFICATE-----\n";

// Topics construits dynamiquement
String TOPIC_CMD;
String TOPIC_STATUS;

// Matrice NeoPixel
#define PIN_MATRIX     D5
#define MAT_W          112 // 96 = 6 matrices en ligne, sinon je peux mettre un peu plus
#define MAT_H          16
#define MATRIX_SIZE    16
Adafruit_NeoMatrix matrix(
  MAT_W, MAT_H, PIN_MATRIX,
  NEO_MATRIX_TOP+NEO_MATRIX_LEFT+NEO_MATRIX_COLUMNS+NEO_MATRIX_ZIGZAG,
  NEO_GRB+NEO_KHZ800
);

int SCREEN_WIDTH = 48;
int SCREEN_HEIGHT = 16;
int screenMatrixCount = SCREEN_WIDTH / MATRIX_SIZE;
int realMatrixCount   = MAT_W / MATRIX_SIZE;

// ─── BUFFERS GLOBAUX ────────────────────────────────────────────────────────
uint8_t  imageBuffer[MAT_W * MAT_H * 3];
bool     imageBufferValid = false;

// Paramètres QR
#define QR_MODULE_BLACK_R   255    
#define QR_MODULE_BLACK_G   255
#define QR_MODULE_BLACK_B   255
#define QR_MODULE_WHITE_R   0     
#define QR_MODULE_WHITE_G   0      
#define QR_MODULE_WHITE_B   0     

// État des animations
struct LyricsState {
  uint16_t textColor, bgColor;
  String animation;
  String text;
  bool active;
  int scrollX;
};
LyricsState lyrics;

struct AdsState {
  uint16_t textColor, bgColor;
  String animation;
  const char* content;
  float speed;
  bool active;
  int scrollX;
};
AdsState ads;

struct WaitingAnimation {
  bool active;
  int phase;
  int direction;
  unsigned long lastUpdate;
  int textX;
  int bgPhase;
  const char* text = "Waiting...";
  int text_width = 60;
};
WaitingAnimation waitingAnim;

struct PowerAnimation {
  bool active;
  bool isOn;
  int phase;
  int brightness;
  unsigned long lastUpdate;
  String text;
};
PowerAnimation powerAnim;

struct FadeAnimation {
  bool active;
  bool fadeIn;
  int startBrightness;
  int targetBrightness;
  int currentBrightness;
  unsigned long startTime;
  unsigned long duration;
  bool shouldStartWaiting;
};
FadeAnimation fadeAnim;

// MQTT client avec buffer élargi
WiFiClient wifiClient;
PubSubClient mqtt(wifiClient);

// MQTTS client avec buffer élargi
// WiFiClientSecure wifiClient;
// PubSubClient mqtt(wifiClient);

unsigned long lastHeartbeat = 0;
unsigned long lastRender = 0;

// Données de Refresh
#define REFRESH_INTERVAL 2000

unsigned long lastRefresh = 0;
int previousRealMatrixCount = -1;

// Variable pour Config écran
bool   isConfigured = false;

// ─── PROTOTYPES ─────────────────────────────────────────────────────────────
void startupAnimation();
void startWaitingAnimation();
void stopWaitingAnimation();
void renderWaitingAnimation();
void startPowerAnimation(bool isOn);
void startFadeAnimation(bool fadeIn, unsigned long duration);
void renderPowerAnimation();

void updateFadeAnimation();

void setupWiFi();
void setupMQTT();
void mqttCallback(char* topic, byte* payload, unsigned int length);
void reconnectMQTT();
void sendHeartbeat();

// Handlers des commandes
void handleVisualPlay(const JsonDocument& doc);
void handleVisualStop();
void handleQRPlay(const JsonDocument& doc);
void handleQRStop();
void handleLyricsPlay(const JsonDocument& doc);
void handleLyricsBlock(const JsonDocument& doc);
void handleLyricsStop();
void handleAdsPlay(const JsonDocument& doc);
void handleAdsStop();
void handleBrightness(const JsonDocument& doc);

void handlePowerOff();
void handlePowerOn();
void handleClear();
void handleConfig(const JsonDocument& doc);

// Rendu
void updateDisplay();
void renderLyrics();
void renderAds();
void renderDefault();
void renderMatrixOut(int startMatrix, int matrixCount);
void refreshMatrixOutIfNeeded();
void refreshVisualIfNeeded();

// Utilitaires
int base64Decode(const char* input, uint8_t* output, size_t maxOutputSize);
uint16_t mapColor(const String& name);
uint16_t colorWheel(uint8_t pos);
void verifConfig();

// ─── ANIMATIONS ─────────────────────────────────────────────────────────────────
void startupAnimation() {
  Serial.println("🌈 Animation de démarrage...");
  
  matrix.clear();
  
  // Balayage coloré pour identifier l'ESP
  uint32_t colors[] = {
    matrix.Color(255, 0, 0),    // Rouge
    matrix.Color(0, 255, 0),    // Vert
    matrix.Color(0, 0, 255),    // Bleu
    matrix.Color(255, 255, 0),   // Jaune
    matrix.Color(255, 0, 255),   // Magenta
    matrix.Color(0, 255, 255),   // Cyan
    matrix.Color(255, 128, 0),   // Orange
    matrix.Color(128, 0, 255)    // Violet
  };
  
  uint32_t myColor = colors[(CHILD_NUM - 1) % 8];
  
  // Balayage horizontal
  for (int x = 0; x < 48; x++) {
    matrix.clear();
    for (int y = 0; y < 16; y++) {
      matrix.drawPixel(x, y, myColor);
    }
    matrix.show();
    delay(20);
  }
  
  // Afficher le numéro de l'ESP (simple)
  matrix.clear();
  matrix.setTextColor(myColor);
  matrix.setTextSize(1);
  // matrix.setCursor(20, 4);
  // matrix.print(CHILD_NUM);
  int16_t x1,y1; uint16_t w,h;
  matrix.getTextBounds(String(CHILD_NUM),0,0,&x1,&y1,&w,&h);
  int16_t x = (SCREEN_WIDTH - w)/2;
  int16_t y = (SCREEN_HEIGHT - h)/2;
  matrix.setCursor(x, y);
  matrix.print(String(CHILD_NUM));
  
  matrix.show();
  delay(2000);
  
  matrix.clear();
  matrix.show();
}

// ─── ANIMATION "WAITING" ───────────────────────────────────────────────────
void startWaitingAnimation() {
  waitingAnim.active = true;
  waitingAnim.phase = 0;
  waitingAnim.direction = 1;
  waitingAnim.lastUpdate = millis();
  waitingAnim.textX = SCREEN_WIDTH;
  waitingAnim.bgPhase = 0;
  Serial.println("🔄 Animation Waiting démarrée");
  renderWaitingAnimation();
}

void stopWaitingAnimation() {
  waitingAnim.active = false;
  Serial.println("🛑 Animation Waiting arrêtée");
}

