Makker5000/TFE---Party-Screen/ESP-Enfant1/FINAL-ESP8266-Enfant1.c
void renderWaitingAnimation() {
  if (!waitingAnim.active) return;
  
  unsigned long now = millis();
  if (now - waitingAnim.lastUpdate < 10) return; // 80ms = ~12 FPS
  
  waitingAnim.lastUpdate = now;
  
  // Animation du fond avec vague de couleur
  // matrix.fillScreen(matrix.Color(0, 32, 64));
  
  // Créer une vague de couleur en arrière-plan
  // for (int x = 0; x < SCREEN_WIDTH; x++) {
  //   for (int y = 0; y < SCREEN_HEIGHT; y++) {
  //     float wave = sin((x + waitingAnim.bgPhase) * 0.6) * 127 + 128;
  //     int intensity = (int)constrain(wave, 5, 70);
  //     uint32_t bgColor = matrix.Color(intensity, 10, 0); // Bleu-cyan subtil
  //     matrix.drawPixel(x, y, bgColor);
  //   }
  // }

  // 1) Étendue maximale du dégradé en diagonale
  const int maxDiag = SCREEN_WIDTH + SCREEN_HEIGHT - 2;  

  // 2) Avance du dégradé (0 → maxDiag)
  int phase = waitingAnim.bgPhase % (maxDiag + 1);

  // 3) Deux couleurs de coin à coin (modifiable)
  uint8_t r1 = 139, g1 = 0,   b1 = 139;    // coin bas-droite : rouge
  uint8_t r2 = 128,   g2 = 64,   b2 = 0;  // coin haut-gauche : bleu

  // 4) Pour chaque pixel, on calcule sa "distance diagonale" x+y
  for (int x = 0; x < SCREEN_WIDTH; x++) {
    for (int y = 0; y < SCREEN_HEIGHT; y++) {
      // distance sur l'axe diag
      int d = x + y;  
      // on fait glisser le profil : d_shift = (d + phase) mod (maxDiag+1)
      int d_shift = (d + phase) % (maxDiag + 1);
      // ratio entre 0 (bleu) et 1 (rouge)
      // float t = float(d_shift) / float(maxDiag + 5);
      float u = float(d_shift) / float(maxDiag);
      float t = (1.0 - cos(u * PI)) * 0.5;

      // interpolation linéaire R,G,B
      uint8_t r = r1 * t + r2 * (1.0 - t);
      uint8_t g = g1 * t + g2 * (1.0 - t);
      uint8_t b = b1 * t + b2 * (1.0 - t);

      matrix.drawPixel(x, y, matrix.Color(r, g, b));
    }
  }

  // ----- Essai d'afficher seulement sur les matrices valides (NON FONCTIONNEL --> texte ne s'affiche pas) ------
  if (waitingAnim.textX > -waitingAnim.text_width && waitingAnim.textX < SCREEN_WIDTH) {
    const int CHAR_W = 6;  // largeur d'un caractère en pixels (avec espacement)
    int len = strlen(waitingAnim.text);
    int textStart = waitingAnim.textX;
    int textEnd = textStart + waitingAnim.text_width;
    
    // Si le texte dépasse la zone configurée à droite, on le tronque
    if (textEnd > SCREEN_WIDTH) {
      // Calculer combien de caractères on peut afficher
      int visibleWidth = SCREEN_WIDTH - textStart;
      int visibleChars = visibleWidth / CHAR_W;
      
      if (visibleChars > 0 && visibleChars <= len) {
        // Créer une sous-chaîne avec seulement les caractères visibles
        char tempText[32];
        strncpy(tempText, waitingAnim.text, visibleChars);
        tempText[visibleChars] = '\0';
        
        matrix.setTextColor(matrix.Color(255, 255, 255));
        matrix.setTextSize(1);
        matrix.setTextWrap(false);
        matrix.setCursor(waitingAnim.textX, 4);
        matrix.print(tempText);
      }
    } else {
      // Le texte tient entièrement dans la zone configurée
      matrix.setTextColor(matrix.Color(255, 255, 255));
      matrix.setTextSize(1);
      matrix.setTextWrap(false);
      matrix.setCursor(waitingAnim.textX, 4);
      matrix.print(waitingAnim.text);
    }
  }
  
  // Texte "Waiting..." qui défile
  // matrix.setTextColor(matrix.Color(255, 255, 255));
  // matrix.setTextSize(1);
  // matrix.setTextWrap(false);
  // matrix.setCursor(waitingAnim.textX, 4);
  // matrix.print(waitingAnim.text);
  
  // Animation du texte (défilement)
  waitingAnim.textX--;
  if (waitingAnim.textX < -waitingAnim.text_width) { // "Waiting..." fait environ 60 pixels
    waitingAnim.textX = SCREEN_WIDTH;
  }
  
  // Phase de l'animation du fond
  // waitingAnim.bgPhase++;
  // if (waitingAnim.bgPhase > 628) waitingAnim.bgPhase = 0; // 2*PI*100 pour cycle complet
  // 6) Incrément de phase pour animer le dégradé
  waitingAnim.bgPhase++;
  
  matrix.show();
  refreshMatrixOutIfNeeded();
}

// ─── ANIMATIONS "ON" ET "OFF" ──────────────────────────────────────────────
void startPowerAnimation(bool isOn) {
  stopWaitingAnimation();

  powerAnim.active = true;
  powerAnim.isOn = isOn;
  powerAnim.phase = 0;
  powerAnim.brightness = isOn ? 0 : 255;
  powerAnim.lastUpdate = millis();
  powerAnim.text = isOn ? "ON" : "OFF";
  Serial.printf("⚡ Animation Power %s démarrée\n", isOn ? "ON" : "OFF");
}

void renderPowerAnimation() {
  if (!powerAnim.active) return;
  
  unsigned long now = millis();
  if (now - powerAnim.lastUpdate < 50) return; // 50ms = 20 FPS
  
  powerAnim.lastUpdate = now;
  
  if (powerAnim.isOn) {
    // Animation "ON" - Rideau qui s'ouvre + texte qui apparaît
    matrix.fillScreen(0);
    
    // Effet rideau qui s'ouvre (du centre vers les bords)
    int curtainPos = map(powerAnim.phase, 0, 100, SCREEN_WIDTH/2, 0);
    
    // Dessiner le "rideau" qui se retire
    for (int x = 0; x < curtainPos; x++) {
      for (int y = 0; y < SCREEN_HEIGHT; y++) {
        matrix.drawPixel(x, y, matrix.Color(20, 20, 20));
        matrix.drawPixel(SCREEN_WIDTH - 1 - x, y, matrix.Color(20, 20, 20));
      }
    }
    
    // Texte "ON" qui apparaît progressivement
    int textBrightness = map(powerAnim.phase, 30, 100, 0, 255);
    textBrightness = constrain(textBrightness, 0, 255);
    
    matrix.setTextColor(matrix.Color(0, textBrightness, 0)); // Vert
    matrix.setTextSize(1);
    
    // Centrer le texte "ON"
    int16_t x1, y1; uint16_t w, h;
    matrix.getTextBounds("ON", 0, 0, &x1, &y1, &w, &h);
    int16_t x = (SCREEN_WIDTH - w) / 2;
    int16_t y = (SCREEN_HEIGHT - h) / 2;
    matrix.setCursor(x, y);
    matrix.print("ON");
    
  } else {
    // Animation "OFF" - Rideau qui se ferme + texte qui disparaît
    matrix.fillScreen(0);
    
    // Texte "OFF" qui disparaît progressivement
    int textBrightness = map(powerAnim.phase, 0, 70, 255, 0);
    textBrightness = constrain(textBrightness, 0, 255);
    
    matrix.setTextColor(matrix.Color(textBrightness, 0, 0)); // Rouge
    matrix.setTextSize(1);
    
    // Centrer le texte "OFF"
    int16_t x1, y1; uint16_t w, h;
    matrix.getTextBounds("OFF", 0, 0, &x1, &y1, &w, &h);
    int16_t x = (SCREEN_WIDTH - w) / 2;
    int16_t y = (SCREEN_HEIGHT - h) / 2;
    matrix.setCursor(x, y);
    matrix.print("OFF");
    
