Makker5000/TFE---Party-Screen/ESP-Enfant1/FINAL-ESP8266-Enfant1.c
    // Effet rideau qui se ferme (des bords vers le centre)
    int curtainPos = map(powerAnim.phase, 30, 100, 0, SCREEN_WIDTH/2);
    
    for (int x = 0; x < curtainPos; x++) {
      for (int y = 0; y < SCREEN_HEIGHT; y++) {
        matrix.drawPixel(x, y, matrix.Color(20, 20, 20));
        matrix.drawPixel(SCREEN_WIDTH - 1 - x, y, matrix.Color(20, 20, 20));
      }
    }
  }
  
  matrix.show();
  
  // Progression de l'animation
  powerAnim.phase += 2;
  if (powerAnim.phase >= 100) {
    powerAnim.active = false;
    Serial.printf("✅ Animation Power %s terminée\n", powerAnim.isOn ? "ON" : "OFF");
  }
}

// ─── ANIMATION DE FADE (LUMINOSITÉ PROGRESSIVE) ────────────────────────────
void startFadeAnimation(bool fadeIn, unsigned long duration = 1000) {
  fadeAnim.active = true;
  fadeAnim.fadeIn = fadeIn;
  fadeAnim.startBrightness = matrix.getBrightness(); // Prendre la luminosité actuelle
  fadeAnim.targetBrightness = fadeIn ? 50 : 10; // Luminosité cible
  fadeAnim.currentBrightness = fadeAnim.startBrightness;
  fadeAnim.startTime = millis();
  fadeAnim.duration = duration;
  fadeAnim.shouldStartWaiting = !fadeIn; // Si fade out, redémarrer waiting après
  
  Serial.printf("🌅 Animation Fade %s démarrée (%lu ms) - de %d à %d\n", 
                fadeIn ? "IN" : "OUT", duration, fadeAnim.startBrightness, fadeAnim.targetBrightness);
}

void updateFadeAnimation() {
  if (!fadeAnim.active) return;
  
  unsigned long elapsed = millis() - fadeAnim.startTime;
  
  if (elapsed >= fadeAnim.duration) {
    // Animation terminée
    fadeAnim.currentBrightness = fadeAnim.targetBrightness;
    matrix.setBrightness(fadeAnim.currentBrightness);
    fadeAnim.active = false;
    
    // Si c'était un fade out, redémarrer l'animation waiting
    if (fadeAnim.shouldStartWaiting) {
      Serial.println("🔄 Redémarrage animation waiting après fade out");
      startWaitingAnimation();
    }
    
    Serial.printf("✅ Animation Fade terminée (luminosité: %d)\n", 
                  fadeAnim.currentBrightness);
  } else {
    // Interpolation linéaire
    float progress = (float)elapsed / fadeAnim.duration;
    fadeAnim.currentBrightness = fadeAnim.startBrightness + 
      (fadeAnim.targetBrightness - fadeAnim.startBrightness) * progress;
    matrix.setBrightness(fadeAnim.currentBrightness);
  }
}

// ─── HELPERS POUR UTILISER LES ANIMATIONS ──────────────────────────────────
void playPowerOnAnimation() {
  // Arrêter l'animation waiting si elle est active
  stopWaitingAnimation();
  // Démarrer l'animation ON avec fade
  startFadeAnimation(true, 800);
  startPowerAnimation(true);
}

void playPowerOffAnimation() {
  // Démarrer l'animation OFF avec fade
  startFadeAnimation(false, 800);
  startPowerAnimation(false);
}

// Fonction pour démarrer une fonctionnalité avec animation
void startFeatureWithAnimation() {
  stopWaitingAnimation();
  startFadeAnimation(true, 600);
}

// Fonction pour arrêter une fonctionnalité avec animation
void stopFeatureWithAnimation() {
  startFadeAnimation(false, 400);
  // Programmer le retour à l'animation waiting après le fade
  // On va utiliser une variable pour ça
}

// ─── SETUP ─────────────────────────────────────────────────────────────────
void setup() {
  Serial.begin(115200);
  Serial.println();
  Serial.printf("🚀 ESP8266 Enfant #%d - Démarrage...\n", CHILD_NUM);
  
  // Construction des topics
  TOPIC_CMD    = "esp/enfant" + String(CHILD_NUM) + "/command";
  TOPIC_STATUS = "esp/enfant" + String(CHILD_NUM) + "/status";
  
  Serial.printf("📡 Topics: CMD='%s', STATUS='%s'\n", TOPIC_CMD.c_str(), TOPIC_STATUS.c_str());
  
  // Initialisation matrice
  matrix.begin();
  matrix.setBrightness(50);
  matrix.fillScreen(0);
  matrix.show();
  Serial.println("🎨 Matrice initialisée");
  
  // Initialisation états
  lyrics.active = false;
  ads.active = false;

  waitingAnim.active = false;
  powerAnim.active = false;
  fadeAnim.active = false;
  fadeAnim.shouldStartWaiting = false;

  EEPROM.begin(EEPROM_SIZE);
  loadConfig();
  
  // Connexions
  setupWiFi();
  setupMQTT();

  startupAnimation();

  startWaitingAnimation();
  
  Serial.println("✅ Initialisation terminée");
  sendHeartbeat();
}

// ─── LOOP ──────────────────────────────────────────────────────────────────
void loop() {
  // Maintenir la connexion MQTT
  if (!mqtt.connected()) {
    reconnectMQTT();
  }
  mqtt.loop();
  
  // Heartbeat périodique
  if (millis() - lastHeartbeat > 30000) {
    sendHeartbeat();
    lastHeartbeat = millis();
  }
  
  // Rendu à 20 FPS max
  if (millis() - lastRender > 10) {
    updateDisplay();
    lastRender = millis();
  }
  
  yield();
}

// ─── CONFIGURATION WIFI ────────────────────────────────────────────────────
void setupWiFi() {
  Serial.printf("📶 Connexion WiFi à '%s'...\n", WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  
  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(500);
    Serial.print(".");
    attempts++;
  }
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n✅ WiFi connecté - IP: %s\n", WiFi.localIP().toString().c_str());
    Serial.printf("   Signal: %d dBm\n", WiFi.RSSI());
  } else {
    Serial.println("\n❌ Échec connexion WiFi");
    ESP.restart();
  }
}

// ─── CONFIGURATION MQTT ────────────────────────────────────────────────────
void setupMQTT() {
  Serial.printf("🔗 Configuration MQTT: %s:%d\n", MQTT_BROKER, MQTT_PORT);
  
  // mqtt.setCACert(ca_cert);
  mqtt.setServer(MQTT_BROKER, MQTT_PORT);
  mqtt.setCallback(mqttCallback);
  mqtt.setBufferSize(MQTT_MAX_PACKET_SIZE); // Buffer élargi pour les grandes images
  
  reconnectMQTT();
}

void reconnectMQTT() {
  int attempts = 0;
  while (!mqtt.connected() && attempts < 5) {
    Serial.printf("🔄 Tentative MQTT %d...\n", attempts + 1);
    
    String clientId = "ESPEnfant" + String(CHILD_NUM) + "_" + String(random(0xffff), HEX);
    
    if (mqtt.connect(clientId.c_str())) {
      Serial.printf("✅ MQTT connecté avec ID: %s\n", clientId.c_str());
      
      // Subscription avec QoS 1 pour fiabilité
      if (mqtt.subscribe(TOPIC_CMD.c_str(), 1)) {
        Serial.printf("📺 Abonné au topic: %s\n", TOPIC_CMD.c_str());
      } else {
        Serial.println("❌ Échec subscription");
      }
      
