Makker5000/TFE---Party-Screen/ESP-Enfant1/FINAL-ESP8266-Enfant1.c
      sendHeartbeat();
      return;
    }
    
    Serial.printf("❌ Échec MQTT (code %d), retry dans 2s\n", mqtt.state());
    delay(2000);
    attempts++;
  }
  
  if (!mqtt.connected()) {
    Serial.println("❌ Impossible de se connecter au MQTT, redémarrage...");
    delay(1000);
    ESP.restart();
  }
}

void sendHeartbeat() {
  if (!mqtt.connected()) return;
  
  DynamicJsonDocument doc(256);
  doc["child_id"] = CHILD_NUM;
  doc["status"] = "online";
  doc["ip"] = WiFi.localIP().toString();
  doc["rssi"] = WiFi.RSSI();
  doc["free_heap"] = ESP.getFreeHeap();
  doc["uptime"] = millis();
  
  String payload;
  serializeJson(doc, payload);
  
  // if (mqtt.publish(TOPIC_STATUS.c_str(), payload.c_str(), true)) {
    Serial.printf("💓 Heartbeat envoyé (heap: %d)\n", ESP.getFreeHeap());
  // }
}

// ─── CALLBACK MQTT ─────────────────────────────────────────────────────────
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  Serial.printf("📨 Message reçu [%s] - %d bytes\n", topic, length);
  
  // Allouer buffer pour JSON avec marge de sécurité
  size_t jsonSize = length + 1024;
  DynamicJsonDocument* doc = new DynamicJsonDocument(jsonSize);
  
  if (!doc) {
    Serial.println("❌ Échec allocation JSON");
    return;
  }
  
  DeserializationError error = deserializeJson(*doc, payload, length);
  if (error) {
    Serial.printf("❌ Erreur JSON: %s\n", error.c_str());
    delete doc;
    return;
  }
  
  // Debug: afficher la commande reçue
  if (doc->containsKey("FLAG")) {
    Serial.printf("🎯 FLAG: %s\n", (*doc)["FLAG"].as<String>().c_str());
  }
  if (doc->containsKey("CMD")) {
    Serial.printf("🎯 CMD: %s\n", (*doc)["CMD"].as<String>().c_str());
  }
  
  // Traitement des commandes
  String flag = (*doc)["FLAG"] | "";
  String cmd = (*doc)["CMD"] | "";
  
  // Commandes avec FLAG
  if (flag == "VISUAL_PLAY") {
    handleVisualPlay(*doc);
  } else if (flag == "VISUAL_STOP") {
    handleVisualStop();
  } else if (flag == "QR_PLAY") {
    handleQRPlay(*doc);
  } else if (flag == "QR_STOP") {
    handleQRStop();
  }
  // Commandes avec CMD
  else if (cmd == "BRIGHTNESS") {
    handleBrightness(*doc);
  } else if (cmd == "POWER_OFF") {
    handlePowerOff();
  } else if (cmd == "CLEAR") {
    handleClear();
  } else if (cmd == "POWER_ON") {
    handlePowerOn();
  } else if (cmd == "ADS_PLAY") {
    handleAdsPlay(*doc);
  } else if (cmd == "ADS_STOP") {
    handleAdsStop();
  } else if (cmd == "LYRICS_PLAY") {
    handleLyricsPlay(*doc);
  } else if (cmd == "LYRICS_BLOCK") {
    handleLyricsBlock(*doc);
  } else if (cmd == "LYRICS_STOP") {
    handleLyricsStop();
  } else if (cmd == "CONFIG") {
    handleConfig(*doc);
  } else {
    Serial.printf("⚠️ Commande inconnue: FLAG='%s', CMD='%s'\n", flag.c_str(), cmd.c_str());
  }
  
  delete doc;
  Serial.printf("✅ Commande traitée (heap libre: %d)\n", ESP.getFreeHeap());
}

// ─── HANDLERS DES COMMANDES ────────────────────────────────────────────────

void handleVisualPlay(const JsonDocument& doc) {
  const char* b64 = doc["picture"];
  int width = doc["width"];
  int height = doc["height"];
  int segment = doc["segment"];
  
  Serial.printf("🖼️ VISUAL_PLAY: %dx%d, segment=%d, target=%d\n", width, height, segment, CHILD_NUM-1);
  
  // Vérifier si c'est pour nous
  if (segment != (CHILD_NUM - 1)) {
    Serial.println("⏭️ Pas pour moi, ignoré");
    return;
  }
  
  if (!b64 || width != SCREEN_WIDTH) {
    Serial.println("❌ Paramètres image invalides");
    return;
  }
  
  // Arrêter les autres animations
  lyrics.active = false;
  ads.active = false;
  waitingAnim.active = false;
  
  // Décoder et afficher
  memset(imageBuffer, 0, sizeof(imageBuffer));
  int decodedLen = base64Decode(b64, imageBuffer, sizeof(imageBuffer));
  
  if (decodedLen == SCREEN_WIDTH * SCREEN_HEIGHT * 3) {
    imageBufferValid = true;
    
    matrix.fillScreen(0);
    for (int i = 0; i < SCREEN_WIDTH * SCREEN_HEIGHT; i++) {
      int x = i % SCREEN_WIDTH;
      int y = i / SCREEN_WIDTH;
      uint32_t color = matrix.Color(
        imageBuffer[i*3], 
        imageBuffer[i*3+1], 
        imageBuffer[i*3+2]
      );
      matrix.drawPixel(x, y, color);
    }
    matrix.show();
    
    Serial.printf("✅ Image affichée (%d pixels)\n", SCREEN_WIDTH * SCREEN_HEIGHT);
  } else {
    Serial.printf("❌ Décodage échoué: %d bytes (attendu %d)\n", decodedLen, SCREEN_WIDTH * SCREEN_HEIGHT * 3);
  }
  verifConfig();
}

void handleVisualStop() {
  Serial.println("🛑 VISUAL_STOP");
  imageBufferValid = false;
  waitingAnim.active = true;
  matrix.fillScreen(0);
  matrix.show();
}

void handleQRPlay(const JsonDocument& doc) {
  int width = doc["width"];
  int height = doc["height"];
  int section = doc["section"];
  const char* b64 = doc["data"];
  
  Serial.printf("📱 QR_PLAY: %dx%d, section=%d, target=%d\n", width, height, section, CHILD_NUM-1);
  
  if (section != (CHILD_NUM - 1)) {
    Serial.println("⏭️ Pas pour moi, ignoré");
    return;
  }
  
  if (!b64 || width <= 0 || height <= 0) {
    Serial.println("❌ Paramètres QR invalides");
    return;
  }
  
  // Arrêter les autres animations
  lyrics.active = false;
  ads.active = false;
  imageBufferValid = false;
  waitingAnim.active = false;
  
  // Allouer buffer temporaire
  size_t bufferSize = width * height * 3;
  uint8_t* qrBuffer = (uint8_t*)malloc(bufferSize);
  if (!qrBuffer) {
    Serial.println("❌ Échec allocation QR buffer");
    return;
  }
  
  // Décoder
  int decoded = base64Decode(b64, qrBuffer, bufferSize);
  if (decoded != bufferSize) {
    Serial.printf("❌ Décodage QR échoué: %d/%d bytes\n", decoded, bufferSize);
    free(qrBuffer);
    return;
  }
  
  // Afficher
  matrix.fillScreen(0);
  for (int y = 0; y < min(SCREEN_HEIGHT, height); y++) {
    for (int x = 0; x < min(SCREEN_WIDTH, width); x++) {
      int idx = (y * width + x) * 3;
      uint8_t r = qrBuffer[idx];
      uint8_t g = qrBuffer[idx + 1];
      uint8_t b = qrBuffer[idx + 2];
      
      // Seuil pour QR: noir->blanc, blanc->noir
      int brightness = (r + g + b) / 3;
      uint32_t color;
      if (brightness < 128) {
        color = matrix.Color(QR_MODULE_BLACK_R, QR_MODULE_BLACK_G, QR_MODULE_BLACK_B);
      } else {
        color = matrix.Color(QR_MODULE_WHITE_R, QR_MODULE_WHITE_G, QR_MODULE_WHITE_B);
      }
      
      matrix.drawPixel(x, y, color);
    }
    yield();
  }
  matrix.show();
  
  free(qrBuffer);
  Serial.printf("✅ QR affiché (%dx%d)\n", width, height);
  verifConfig();
}

void handleQRStop() {
  Serial.println("🛑 QR_STOP");
  imageBufferValid = false;
  waitingAnim.active = true;
  matrix.fillScreen(0);
  matrix.show();
}

void handleLyricsPlay(const JsonDocument& doc) {
  Serial.println("🎵 LYRICS_PLAY");
  waitingAnim.active = false;
  matrix.fillScreen(0);
  
  lyrics.textColor = mapColor(doc["textColor"] | "white");
  lyrics.bgColor = mapColorBg(doc["backgroundColor"] | "black");
  lyrics.animation = doc["animation"] | "none";
  lyrics.active = true;
  // lyrics.text = "";
  
  // Arrêter les autres
  ads.active = false;
  imageBufferValid = false;
  
  // Init scroll
  if (lyrics.animation == "scroll_left") {
    lyrics.scrollX = SCREEN_WIDTH;
  } else if (lyrics.animation == "scroll_right") {
    lyrics.scrollX = -100; // Sera ajusté avec le texte
  }
  
  Serial.printf("✅ Lyrics activés: couleur=0x%04X, anim=%s\n", lyrics.textColor, lyrics.animation.c_str());
  verifConfig();
}

void handleLyricsBlock(const JsonDocument& doc) {
  if (!lyrics.active) return;
  
  lyrics.text = doc["text"] | "";
  Serial.printf("🎤 LYRICS_BLOCK: '%s'\n", lyrics.text.c_str());
  
  if (lyrics.animation == "none") {
    // Affichage statique immédiat
    matrix.fillScreen(lyrics.bgColor);
    matrix.setTextColor(lyrics.textColor);
    matrix.setTextSize(1);
    matrix.setTextWrap(true);

    int16_t x1,y1; uint16_t w,h;
    matrix.getTextBounds(lyrics.text,0,0,&x1,&y1,&w,&h);
    int16_t x = (SCREEN_WIDTH - w)/2;
    int16_t y = (SCREEN_HEIGHT - h)/2;
    matrix.setCursor(x, y);

    matrix.print(lyrics.text);
    matrix.show();

    verifConfig();
  }
  // Sinon, sera géré par updateDisplay()
  verifConfig();
}

void handleLyricsStop() {
  Serial.println("🛑 LYRICS_STOP");
  lyrics.active = false;
  waitingAnim.active = true;
  matrix.fillScreen(0);
  matrix.show();
}

