Makker5000/TFE---Party-Screen/ESP-Enfant1/FINAL-ESP8266-Enfant1.c
void handleAdsPlay(const JsonDocument& doc) {
  Serial.println("📢 ADS_PLAY");
  waitingAnim.active = false;

  // stopWaitingAnimation();
  // startFeatureWithAnimation();
  
  ads.textColor = mapColor(doc["textColor"] | "white");
  ads.bgColor = mapColorBg(doc["bgColor"] | "black");
  ads.animation = doc["animation"] | "none";
  ads.content = doc["content"] | "";
  ads.speed = doc["speed"] | 1.0;
  ads.active = true;
  
  // Arrêter les autres
  lyrics.active = false;
  imageBufferValid = false;
  
  // Init scroll
  if (ads.animation == "scroll_left") {
    ads.scrollX = SCREEN_WIDTH;
    Serial.println("------ handleAdsPlay : scroll_left initialisé !");
  } else if (ads.animation == "scroll_right") {
    ads.scrollX = -(strlen(ads.content) * 6);
    Serial.println("------ handleAdsPlay : scroll_right initialisé !");
  } else if (ads.animation == "none") {
    // Si l'animation est Statique on centre le texte et on l'affiche
    matrix.fillScreen(ads.bgColor);
    matrix.setTextColor(ads.textColor);
    matrix.setTextWrap(true);
    matrix.setTextSize(1);

    int16_t x1,y1; uint16_t w,h;
    matrix.getTextBounds(ads.content,0,0,&x1,&y1,&w,&h);
    int16_t x = (SCREEN_WIDTH - w)/2;
    int16_t y = (SCREEN_HEIGHT - h)/2;
    matrix.setCursor(x, y);

    matrix.print(ads.content);
    matrix.show();
  }
  
  verifConfig();
  Serial.printf("✅ Ads activés: '%s', anim=%s\n", ads.content, ads.animation.c_str());
}

void handleAdsStop() {
  Serial.println("🛑 ADS_STOP");
  ads.active = false;
  waitingAnim.active = true;
  // renderDefault();
  // stopFeatureWithAnimation();
}

void handleBrightness(const JsonDocument& doc) {
  int brightness = constrain(doc["value"] | 50, 0, 255);
  matrix.setBrightness(brightness);
  matrix.show();
  Serial.printf("💡 Luminosité: %d\n", brightness);
}

void handlePowerOn(){
  Serial.println("🧹 POWER_ON");

  waitingAnim.active = true;
  // powerAnim.active = true;
  // fadeAnim.active = true;
  // fadeAnim.shouldStartWaiting = true;

  // renderDefault();
  // renderWaitingAnimation();
}

void handlePowerOff() {
  Serial.println("🧹 POWER_OFF");

  lyrics.active = false;
  ads.active = false;
  imageBufferValid = false;
  waitingAnim.active = false;
  powerAnim.active = false;
  fadeAnim.active = false;
  fadeAnim.shouldStartWaiting = false;

  matrix.fillScreen(0);
  matrix.show();
}

void handleClear() {
  Serial.println("🧹 CLEAR");

  lyrics.active = false;
  ads.active = false;
  imageBufferValid = false;
  waitingAnim.active = true;

  matrix.fillScreen(0);
  matrix.show();
}

void handleConfig(const JsonDocument& doc) {
  SCREEN_WIDTH = doc["screenWidth"];
  SCREEN_HEIGHT = doc["screenHeight"];

  isConfigured = true;

  saveConfig();

  verifConfig();
}

void verifConfig() {
  screenMatrixCount = SCREEN_WIDTH / MATRIX_SIZE;
  realMatrixCount   = MAT_W / MATRIX_SIZE;

  if (realMatrixCount > screenMatrixCount) {
    int overflowCount = realMatrixCount - screenMatrixCount;
    
    Serial.print("[Config] ");
    Serial.print(overflowCount);
    Serial.println(" matrices non configurées détectées.");

    // Affiche une croix rouge clignotante sur les matrices non prises en compte
      renderMatrixOut(screenMatrixCount, overflowCount);
  } else {
    Serial.println("[Config] Toutes les matrices sont prises en compte dans la configuration.");
  }
}

// ------ Save Config ------
void saveConfig() {
  EEPROM.write(ADDR_CONFIGURED, 1);
  EEPROM.write(ADDR_SCREEN_WIDTH, SCREEN_WIDTH);
  EEPROM.write(ADDR_SCREEN_HEIGHT, SCREEN_HEIGHT);
  EEPROM.commit();
  
  Serial.println("[Config] Configuration sauvegardée en EEPROM");
}

// ------ Load Config ------
bool loadConfig() {
  bool configured = EEPROM.read(ADDR_CONFIGURED) == 1;
  
  if (configured) {
    SCREEN_WIDTH  = EEPROM.read(ADDR_SCREEN_WIDTH);
    SCREEN_HEIGHT  = EEPROM.read(ADDR_SCREEN_HEIGHT);

    isConfigured = true;
    
    Serial.println("[Config] Configuration chargée depuis EEPROM :");
    Serial.print("[Config] - Width Configuré : ");
    Serial.println(SCREEN_WIDTH);
    Serial.print("[Config] - Height Configuré : ");
    Serial.println(SCREEN_HEIGHT);
  } else {
    Serial.println("[Config] Aucune configuration trouvée en EEPROM");
    // Configuration par défaut (32x32 logique)
    SCREEN_WIDTH = 48;
    SCREEN_HEIGHT = 16;
    isConfigured = false;
  }
  
  return configured;
}

// ─── RENDU ─────────────────────────────────────────────────────────────────

void updateDisplay() {
  // updateFadeAnimation();
  
  if (powerAnim.active) {
    renderPowerAnimation();
  } else if (imageBufferValid) {
    // L'image statique est déjà affichée, rien à faire
    refreshVisualIfNeeded();
  } else if (lyrics.active && lyrics.animation != "none") {
    renderLyrics();
  } else if (ads.active && ads.animation != "none") {
    renderAds();
  } else if (waitingAnim.active) {
    renderDefault();
  } else {
    // Fallback au comportement par défaut
    // renderDefault();
    // refreshMatrixOutIfNeeded();
    return;
  }
}

// void renderLyrics() {
//   if (lyrics.text.isEmpty()) return;

//   matrix.fillScreen(lyrics.bgColor);
//   matrix.setTextColor(lyrics.textColor);
//   matrix.setTextSize(1);
//   matrix.setTextWrap(false);
//   matrix.setCursor(lyrics.scrollX, 4);
//   matrix.print(lyrics.text);
//   matrix.show();
  
//   int lyrics_length = -(lyrics.text.length() * 6);
//   Serial.printf("lyrics_length = %d\n", lyrics_length);
//   // Animation
//   if (lyrics.animation == "scroll_left") {
//     lyrics.scrollX--;
//     if (lyrics.scrollX < lyrics_length) {
//       lyrics.scrollX = SCREEN_WIDTH;
//       Serial.println("------ renderLyrics : on affiche le texte défilant à GAUCHE !");
//     }
//   } else if (lyrics.animation == "scroll_right") {
//     lyrics.scrollX++;
//     if (lyrics.scrollX > SCREEN_WIDTH) {
//       lyrics.scrollX = -(lyrics.text.length() * 6);
//       Serial.println("------ renderLyrics : on affiche le texte défilant à DROITE !");
//     }
//   }

//   verifConfig();
// }

