Makker5000/TFE---Party-Screen/ESP-Enfant1/FINAL-ESP8266-Enfant1.c
void renderLyrics() {
  if (lyrics.text.isEmpty()) return;

  int speed = 2; // Vitesse fixe comme dans l'original
  int lyrics_length = (lyrics.text.length() * 6);
  
  if (lyrics.animation == "scroll_left") {
    Serial.println("------ renderLyrics : on affiche le texte défilant à GAUCHE !");
    
    // Condition élargie pour permettre l'affichage
    if (lyrics.scrollX > -lyrics_length && lyrics.scrollX < SCREEN_WIDTH) {
      const int CHAR_W = 6;
      int len = lyrics.text.length();
      int textStart = lyrics.scrollX;
      int textEnd = textStart + lyrics_length;
      
      if (textEnd > SCREEN_WIDTH) {
        // Calculer combien de caractères on peut afficher
        int visibleWidth = SCREEN_WIDTH - textStart;
        int visibleChars = visibleWidth / CHAR_W;
        
        if (visibleChars > 0 && visibleChars <= len) {
          String tempText = lyrics.text.substring(0, visibleChars);
          matrix.fillScreen(lyrics.bgColor);
          matrix.setTextColor(lyrics.textColor);
          matrix.setTextSize(1);
          matrix.setTextWrap(false);
          matrix.setCursor(lyrics.scrollX, 4);
          matrix.print(tempText);
        }
      } else {
        // Le texte tient entièrement dans la zone visible
        matrix.fillScreen(lyrics.bgColor);
        matrix.setTextColor(lyrics.textColor);
        matrix.setTextSize(1);
        matrix.setTextWrap(false);
        matrix.setCursor(lyrics.scrollX, 4);
        matrix.print(lyrics.text);
      }
    }
    
    // Défilement vers la gauche
    lyrics.scrollX -= speed;
    
    // Réinitialisation pour scroll_left
    if (lyrics.scrollX <= -lyrics_length) {
      lyrics.scrollX = SCREEN_WIDTH;
    }
    
  } else if (lyrics.animation == "scroll_right") {
    Serial.println("------ renderLyrics : on affiche le texte défilant à DROITE !");
    
    // Condition - on affiche tant que le texte n'est pas complètement sorti à droite
    if (lyrics.scrollX < SCREEN_WIDTH + lyrics_length) {
      const int CHAR_W = 6;
      int len = lyrics.text.length();
      int textStart = lyrics.scrollX;
      int textEnd = textStart + lyrics_length;
      
      // Arrêter de dessiner avant que la première lettre n'atteigne complètement le bord
      if (textStart <= SCREEN_WIDTH - 6) {  // -6 pour la largeur d'un caractère
        if (textEnd > SCREEN_WIDTH) {
          // Le texte dépasse à droite - calculer combien de caractères on peut afficher
          int visibleWidth = SCREEN_WIDTH - textStart;
          int visibleChars = visibleWidth / CHAR_W;
          
          if (visibleChars > 0 && visibleChars <= len) {
            String tempText = lyrics.text.substring(0, visibleChars);
            matrix.fillScreen(lyrics.bgColor);
            matrix.setTextColor(lyrics.textColor);
            matrix.setTextSize(1);
            matrix.setTextWrap(false);
            matrix.setCursor(lyrics.scrollX, 4);
            matrix.print(tempText);
          }
        } else {
          // Le texte tient entièrement (même si une partie est à gauche en négatif)
          matrix.fillScreen(lyrics.bgColor);
          matrix.setTextColor(lyrics.textColor);
          matrix.setTextSize(1);
          matrix.setTextWrap(false);
          matrix.setCursor(lyrics.scrollX, 4);
          matrix.print(lyrics.text);
        }
      } else {
        // Le texte est complètement sorti à droite - effacer l'écran
        matrix.fillScreen(lyrics.bgColor);
      }
    }
    
    // Défilement vers la droite
    lyrics.scrollX += speed;
    
    // Réinitialisation pour scroll_right - attendre que tout le texte soit sorti
    if (lyrics.scrollX >= SCREEN_WIDTH + lyrics_length) {
      lyrics.scrollX = -lyrics_length;
    }
  }

  matrix.show();
  verifConfig();
  // refreshMatrixOutIfNeeded();
}

void renderAds() {
  // --------- Fonctionnel V1 : pas de prise en compte écran config ----------
  // matrix.fillScreen(ads.bgColor);
  // matrix.setTextColor(ads.textColor);
  // matrix.setTextSize(1);
  // matrix.setTextWrap(false);
  // matrix.setCursor(ads.scrollX, 4);
  // matrix.print(ads.content);
  // matrix.show();
  
  // int ads_length = -(ads.content.length() * 6);
  // Serial.printf("ads_length = %d\n", ads_length);
  // // Animation avec vitesse
  // if (ads.animation != "none") {
  //   int step = 1;
  //   if (ads.animation == "scroll_left") {
  //     ads.scrollX -= step;
  //     if (ads.scrollX < ads_length) {
  //       ads.scrollX = SCREEN_WIDTH;
  //       Serial.println("------ renderAds : on affiche le texte défilant !");
  //     }
  //   } else if (ads.animation == "scroll_right") {
  //     ads.scrollX += step;
  //     if (ads.scrollX > SCREEN_WIDTH) {
  //       ads.scrollX = -(ads.content.length() * 6);
  //     }
  //   }
  //   if (ads.speed > 0) delay(int(10.0/(ads.speed*2)));
  // }

  // --------- Fonctionnel V2 : prise en compte écran config mais uniquement 'scroll_left' ----------
  // Serial.println("On fait défile vers la GAUCHE ------------------");
  // int speed = ads.speed > 0 ? ads.speed/2 : 1;
  // int ads_length = (strlen(ads.content) * 6);

  // if (ads.scrollX > (-ads_length) && ads.scrollX < SCREEN_WIDTH) {

  //   const int CHAR_W = 6;  // largeur d'un caractère en pixels (avec espacement)
  //   int len = strlen(ads.content);
  //   int textStart = ads.scrollX;
  //   int textEnd = textStart + ads_length;
    
  //   // Si le texte dépasse la zone configurée à droite, on le tronque
  //   if (textEnd > SCREEN_WIDTH) {
  //     // Calculer combien de caractères on peut afficher
  //     int visibleWidth = SCREEN_WIDTH - textStart;
  //     int visibleChars = visibleWidth / CHAR_W;
      
  //     if (visibleChars > 0 && visibleChars <= len) {
  //       // Créer une sous-chaîne avec seulement les caractères visibles
  //       char tempText[32];
  //       strncpy(tempText, ads.content, visibleChars);
  //       tempText[visibleChars] = '\0';
  //       matrix.fillScreen(ads.bgColor);
  //       matrix.setTextColor(ads.textColor);
  //       matrix.setTextSize(1);
  //       matrix.setTextWrap(false);
  //       matrix.setCursor(ads.scrollX, 4);
  //       matrix.print(tempText);
  //     }
  //   } else {
  //     // Le texte tient entièrement dans la zone configurée
  //     matrix.fillScreen(ads.bgColor);
  //     matrix.setTextColor(ads.textColor);
  //     matrix.setTextSize(1);
  //     matrix.setTextWrap(false);
  //     matrix.setCursor(ads.scrollX, 4);
  //     matrix.print(ads.content);
  //   }
  // }
  // ads.scrollX -= speed;
  // // ads.scrollX--;
  // if (ads.scrollX <= -ads_length) {
  //   ads.scrollX = SCREEN_WIDTH;
  // }
  // if (ads.speed > 0) speed = ads.speed/2;

  // verifConfig();

  // --------- Fonctionnel V3 : prise en compte écran config ----------
  int speed = ads.speed > 1 ? ads.speed/2 : 1;
  int ads_length = (strlen(ads.content) * 6);
  
  if (ads.animation == "scroll_left") {
    Serial.println("On fait défiler vers la GAUCHE ------------------");
    
    // Condition élargie pour permettre l'affichage
    if (ads.scrollX > -ads_length && ads.scrollX < SCREEN_WIDTH) {
      const int CHAR_W = 6;
      int len = strlen(ads.content);
      int textStart = ads.scrollX;
      int textEnd = textStart + ads_length;
      
