Makker5000/TFE---Party-Screen/ESP-Enfant1/FINAL-ESP8266-Enfant1.c
      // Effacer l'écran et configurer l'affichage
      
      if (textEnd > SCREEN_WIDTH) {
        // Calculer combien de caractères on peut afficher
        int visibleWidth = SCREEN_WIDTH - textStart;
        int visibleChars = visibleWidth / CHAR_W;
        
        if (visibleChars > 0 && visibleChars <= len) {
          char tempText[64]; // Augmenté la taille du buffer
          strncpy(tempText, ads.content, visibleChars);
          tempText[visibleChars] = '\0';
          matrix.fillScreen(ads.bgColor);
          matrix.setTextColor(ads.textColor);
          matrix.setTextSize(1);
          matrix.setTextWrap(false);
          matrix.setCursor(ads.scrollX, 4);
          matrix.print(tempText);
        }
      } else {
        // Le texte tient entièrement dans la zone visible
        matrix.fillScreen(ads.bgColor);
        matrix.setTextColor(ads.textColor);
        matrix.setTextSize(1);
        matrix.setTextWrap(false);
        matrix.setCursor(ads.scrollX, 4);
        matrix.print(ads.content);
      }
    }
    
    // Défilement vers la gauche
    ads.scrollX -= speed;
    
    // Réinitialisation pour scroll_left
    if (ads.scrollX <= -ads_length) {
      ads.scrollX = SCREEN_WIDTH;
    }
    
  } else if (ads.animation == "scroll_right") {
    Serial.println("On fait défiler vers la DROITE ------------------");
    
    // Condition simple - on affiche tant que le texte n'est pas complètement sorti à droite
    if (ads.scrollX < SCREEN_WIDTH) {
      const int CHAR_W = 6;
      int len = strlen(ads.content);
      int textStart = ads.scrollX;
      int textEnd = textStart + ads_length;
      
      if (textStart <= SCREEN_WIDTH - 6) {
        if (textEnd > SCREEN_WIDTH) {
          // Le texte dépasse à droite - calculer combien de caractères on peut afficher
          int visibleWidth = SCREEN_WIDTH - textStart;
          int visibleChars = visibleWidth / CHAR_W;
          
          if (visibleChars > 0 && visibleChars <= len) {
            char tempText[64];
            strncpy(tempText, ads.content, visibleChars);
            tempText[visibleChars] = '\0';
            matrix.fillScreen(ads.bgColor);
            matrix.setTextColor(ads.textColor);
            matrix.setTextSize(1);
            matrix.setTextWrap(false);
            matrix.setCursor(ads.scrollX, 4);
            matrix.print(tempText);
          }
        } else {
          // Le texte tient entièrement (même si une partie est à gauche en négatif)
          matrix.fillScreen(ads.bgColor);
          matrix.setTextColor(ads.textColor);
          matrix.setTextSize(1);
          matrix.setTextWrap(false);
          matrix.setCursor(ads.scrollX, 4);
          matrix.print(ads.content);
        }
      } else {
        // Le texte est complètement sorti à droite - effacer l'écran
        matrix.fillScreen(ads.bgColor);
      }
    }
    
    // Défilement vers la droite
    ads.scrollX += speed;
    
    // Réinitialisation pour scroll_right - recommencer depuis la gauche
    if (ads.scrollX >= SCREEN_WIDTH) {
      ads.scrollX = -ads_length;
    }
  }

  verifConfig();
}

void renderDefault() {
  // ----- Affichage Statique -----
  // matrix.fillScreen(0);
  // matrix.setTextColor(matrix.Color(255,255,255));
  // matrix.setTextSize(1);
  // matrix.setCursor(2, 4);
  // matrix.print("ESP" + String(CHILD_NUM));
  // matrix.show();

  // ---- Affichage Dynamique -----
  if (waitingAnim.active && !lyrics.active && 
      !ads.active && !imageBufferValid) {
    renderWaitingAnimation();
  }
}

void renderMatrixOut(int startMatrix, int matrixCount) {
  uint32_t color = matrix.Color(255, 0, 0);

  for (int m = 0; m < matrixCount; m++) {
    int x_offset = (startMatrix + m) * MATRIX_SIZE;

    // Nettoyage de la zone cible
    for (int x = x_offset; x < x_offset + MATRIX_SIZE; x++) {
      for (int y = 0; y < MATRIX_SIZE; y++) {
        matrix.drawPixel(x, y, 0); // Éteint les pixels
      }
    }

    // Dessine la croix rouge
    for (int i = 0; i < MATRIX_SIZE; i++) {
      matrix.drawPixel(x_offset + i, i, color);                         // Diagonale "/"
      matrix.drawPixel(x_offset + i, MATRIX_SIZE - 1 - i, color);      // Diagonale "\"
    }
  }

  matrix.show();
  // delay(1000);
}

void refreshMatrixOutIfNeeded() {
  // On ne fait rien si pas encore assez de temps écoulé
  if (millis() - lastRefresh < REFRESH_INTERVAL) return;

  lastRefresh = millis();

  // Recalcule le nombre réel de matrices connectées
  verifConfig();
}

void refreshVisualIfNeeded() {
  if (millis() - lastRefresh < REFRESH_INTERVAL) return;

  lastRefresh = millis();

  // Recalcule le nombre réel de matrices connectées
  return;
}

// ─── UTILITAIRES ───────────────────────────────────────────────────────────

int base64Decode(const char* input, uint8_t* output, size_t maxOutputSize) {
  if (!input || !output) return -1;
  
  const char* chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
  size_t in_len = strlen(input);
  size_t i = 0, o = 0;
  
  while (i + 3 < in_len && o + 2 < maxOutputSize) {
    int vals[4];
    bool valid = true;
    
    for (int j = 0; j < 4; j++) {
      char c = input[i + j];
      if (c == '=') {
        vals[j] = 0;
      } else {
        const char* pos = strchr(chars, c);
        if (pos) {
          vals[j] = pos - chars;
        } else {
          valid = false;
          break;
        }
      }
    }
    
    if (!valid) {
      i++;
      continue;
    }
    
    uint32_t combined = (vals[0] << 18) | (vals[1] << 12) | (vals[2] << 6) | vals[3];
    
    output[o++] = (combined >> 16) & 0xFF;
    if (input[i + 2] != '=' && o < maxOutputSize) {
      output[o++] = (combined >> 8) & 0xFF;
    }
    if (input[i + 3] != '=' && o < maxOutputSize) {
      output[o++] = combined & 0xFF;
    }
    
    i += 4;
    
    if (i % 100 == 0) yield(); // Éviter le watchdog
  }
  
  return (int)o;
}

uint16_t mapColor(const String& name) {
  String c = name;
  c.toLowerCase();
  if (c == "white") return matrix.Color(255,255,255);
  if (c == "red") return matrix.Color(255,0,0);
  if (c == "green") return matrix.Color(0,255,0);
  if (c == "blue") return matrix.Color(0,0,255);
  if (c == "yellow") return matrix.Color(255,255,0);
  if (c == "cyan") return matrix.Color(0,255,255);
  if (c == "magenta") return matrix.Color(255,0,255);
  if (c == "black" || c == "none") return matrix.Color(0,0,0);
  return matrix.Color(255,255,255);
}

uint16_t mapColorBg(const String& name) {
  String c = name;
  c.toLowerCase();
  if (c == "white") return matrix.Color(127,127,127);
  if (c == "red") return matrix.Color(127,0,0);
  if (c == "green") return matrix.Color(0,127,0);
  if (c == "blue") return matrix.Color(0,0,127);
  if (c == "yellow") return matrix.Color(127,127,0);
  if (c == "cyan") return matrix.Color(0,127,127);
  if (c == "magenta") return matrix.Color(127,0,127);
  if (c == "black" || c == "none") return matrix.Color(0,0,0);
  return matrix.Color(127,127,127);
}